{"books": [{"id": "1", "name": "The final empire", "saga": "Mistborn 1", "sinopsis": "A thousand years ago evil came to the land and has ruled with an iron hand ever since. The sun shines fitfully under clouds of ash that float down endlessly from the constant eruption of volcanoes. A dark lord rules through the aristocratic families and ordinary folk are condemned to lives in servitude, sold as goods, labouring in the ash fields.But now a troublemaker has arrived and there is rumour of revolt. A revolt that depends on a criminal no-one can trust and a young girl who must master Allomancy - the magic that lies in all metals.A New York Times bestseller and a international smash-hit trilogy from the author who wrote the final books in The Wheel of Time sequence.", "price": "17", "pages": "500", "url": "https://i0.wp.com/carlosjeguren.com/wp-content/uploads/2021/04/final-empire.jpg?ssl=1"}, {"id": "2", "name": "The well of ascension", "saga": "Mistborn 2", "sinopsis": "The impossible has happened. The Lord Ruler is dead has been vanquished. But so too is Kelsier the man who masterminded the triumph. The awesome task of rebuilding the world has been left to his protege Vin; a one-time street urchin, now the most powerful Mistborn in the land. Worryingly for her Vin has become the focus of a new religion, a development that leaves her intensely uneasy. More worryingly still the mists have become unpredictable since the Lord Ruler died and a strage vaprous entity is stalking Vin. As the siege of Luthadel intensifies the ancient legend of the Well of Ascension offers the only glimmer of hope. But no-one knows where it is or what it can do...", "price": "17", "pages": "500", "url": "https://images-na.ssl-images-amazon.com/images/I/41wqcX7QpKL._SX326_BO1,204,203,200_.jpg"}, {"id": "3", "name": "The Hero of Ages", "saga": "Mistborn 3", "sinopsis": "Tricked into releasing the evil spirit Ruin while attempting to close the Well of Ascension, new emperor Elend Venture and his wife, the assassin Vin, are now hard-pressed to save the world. This adventure brings the Mistborn epic fantasy trilogy to a dramatic and surprising climax as Sanderson's saga offers complex characters and a compelling plot, asking hard questions about loyalty, faith and responsibility.", "price": "17", "pages": "500", "url": "https://images-na.ssl-images-amazon.com/images/I/51sIAr9O7lL._SX321_BO1,204,203,200_.jpg"}, {"id": "4", "name": "The Way of Kings", "saga": "The Stormlight Archive 1", "sinopsis": "Roshar is a world of stone and storms. Uncanny tempests of incredible power sweep across the rocky terrain so frequently that they have shaped ecology and civilization alike. Animals hide in shells, trees pull in branches, and grass retracts into the soilless ground. Cities are built only where the topography offers shelter.  It has been centuries since the fall of the ten consecrated orders known as the Knights Radiant, but their Shardblades and Shardplate remain: mystical swords and suits of armor that transform ordinary men into near-invincible warriors. Men trade kingdoms for Shardblades. Wars were fought for them, and won by them.  One such war rages on a ruined landscape called the Shattered Plains. There, Kaladin, who traded his medical apprenticeship for a spear to protect his little brother, has been reduced to slavery. In a war that makes no sense, where ten armies fight separately against a single foe, he struggles to save his men and to fathom the leaders who consider them expendable.  Brightlord Dalinar Kholin commands one of those other armies. Like his brother, the late king, he is fascinated by an ancient text called The Way of Kings. Troubled by over-powering visions of ancient times and the Knights Radiant, he has begun to doubt his own sanity.  Across the ocean, an untried young woman named Shallan seeks to train under an eminent scholar and notorious heretic, Dalinar's niece, Jasnah. Though she genuinely loves learning, Shallan's motives are less than pure. As she plans a daring theft, her research for Jasnah hints at secrets of the Knights Radiant and the true cause of the war.  The result of over ten years of planning, writing, and world-building, The Way of Kings is but the opening movement of the Stormlight Archive, a bold masterpiece in the making.  Speak again the ancient oaths:  Life before death. Strength before weakness. Journey before Destination.  and return to men the Shards they once bore.  The Knights Radiant must stand again.", "price": "17", "pages": "500", "url": "https://m.media-amazon.com/images/I/51ZX3mqLFzL.jpg"}]}